In [2]:
#Import neccessary libraries
import pandas as pd

In [3]:
#Read csv file

df=pd.read_csv("universities_ranking.csv")
df

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
0,1,University of Oxford,United Kingdom,"20,774",11.1,41%,46 : 54
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61
...,...,...,...,...,...,...,...
1521,1522,Yuan Ze University,Taiwan,"8,188",19.7,7%,42 : 58
1522,1523,Yuriy Fedkovych Chernivtsi National University,Ukraine,"12,616",10.7,0%,57 : 43
1523,1524,Zagazig University,Egypt,"156,270",24.4,2%,54 : 46
1524,1525,University of Zagreb,Croatia,"59,336",15.3,3%,59 : 41
1525,1526,University of Žilina,Slovakia,"7,136",11.7,2%,34 : 66

In [4]:
#Print first 5 rows of the data
df.tail()

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
1521,1522,Yuan Ze University,Taiwan,"8,188",19.7,7%,42 : 58
1522,1523,Yuriy Fedkovych Chernivtsi National University,Ukraine,"12,616",10.7,0%,57 : 43
1523,1524,Zagazig University,Egypt,"156,270",24.4,2%,54 : 46
1524,1525,University of Zagreb,Croatia,"59,336",15.3,3%,59 : 41
1525,1526,University of Žilina,Slovakia,"7,136",11.7,2%,34 : 66

In [6]:
#To check the data types and null values in the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1526 entries, 0 to 1525
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   ranking               1526 non-null   int64
 1   title                 1526 non-null   object
 2   location              1526 non-null   object
 3   number students       1526 non-null   object
 4   students staff ratio  1526 non-null   float64
 5   perc intl students    1526 non-null   object
 6   gender ratio          1453 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 83.6+ KB

In [7]:
#check for the summeray statistics of the numerical columns in the dataframe
df.describe()

           ranking  students staff ratio
count  1526.000000           1526.000000
mean    763.500000             18.778571
std     440.662569             13.818076
min       1.000000              0.900000
25%     382.250000             12.200000
50%     763.500000             16.100000
75%    1144.750000             21.875000
max    1526.000000            339.100000

In [8]:
#check the first 5 rows of the dataframe
df.head(5)

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
0,1,University of Oxford,United Kingdom,"20,774",11.1,41%,46 : 54
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61

In [9]:
#to get the first 10 rows of the dataframe
df.iloc[1:10]   ##iloc is used to access a group of rows and columns by labels or a boolean array

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61
5,6,University of Cambridge,United Kingdom,"19,370",11.0,38%,47 : 53
6,7,"University of California, Berkeley",United States,"39,918",19.8,17%,51 : 49
7,8,Yale University,United States,"12,910",6.0,20%,50 : 50
8,9,Princeton University,United States,"8,091",8.0,23%,46 : 54
9,10,The University of Chicago,United States,"14,292",5.9,31%,46 : 54

In [10]:
#Checking for the missing values in each column
df.isnull().sum()

ranking                  0
title                    0
location                 0
number students          0
students staff ratio     0
perc intl students       0
gender ratio            73
dtype: int64

In [15]:
#particularly checking for the missing values in the column 'location' 
df['location'] .isnull().sum()

np.int64(0)

In [17]:
#multiple columns check for missing values
df[['title','gender ratio','location']].isnull().sum()

title            0
gender ratio    73
location         0
dtype: int64

In [18]:
#check for the duplicate rows in the dataframe
df.duplicated().sum()

np.int64(0)

### Handle these errors or anomilies

In [23]:
#drop rows with any missing values
df_listwise_deletion=df.dropna()

#drop rows with missing values in gender ratio
df_pairwise_deletion=df.dropna(subset=['gender ratio'])
df_pairwise_deletion.isnull().sum()
df_listwise_deletion.isnull().sum()

ranking                 0
title                   0
location                0
number students         0
students staff ratio    0
perc intl students      0
gender ratio            0
dtype: int64

### IMPUTATION-IMPUTE-FILLING THE VALUES

In [24]:
df.isnull().sum()

ranking                  0
title                    0
location                 0
number students          0
students staff ratio     0
perc intl students       0
gender ratio            73
dtype: int64

In [25]:
df

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
0,1,University of Oxford,United Kingdom,"20,774",11.1,41%,46 : 54
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61
...,...,...,...,...,...,...,...
1521,1522,Yuan Ze University,Taiwan,"8,188",19.7,7%,42 : 58
1522,1523,Yuriy Fedkovych Chernivtsi National University,Ukraine,"12,616",10.7,0%,57 : 43
1523,1524,Zagazig University,Egypt,"156,270",24.4,2%,54 : 46
1524,1525,University of Zagreb,Croatia,"59,336",15.3,3%,59 : 41
1525,1526,University of Žilina,Slovakia,"7,136",11.7,2%,34 : 66

In [33]:
# check the datatype of the gender ratio column
print(df['gender ratio'].dtype)

object

In [36]:
# Convert the object datatype into numeric datatype
import pandas as pd  # importing the pandas library for mathematic computation

df['gender ratio']=pd.to_numeric(df['gender ratio'],
errors='coerce')    #used for-any non numeric values(like text) will be converted to NAN(missing values)

In [37]:
# Calculate the mean of the 'gender ratio' column
mean_gender_ratio=df['gender ratio'].mean()
mean_gender_ratio

nan

In [30]:
#create a copy of the dataframe to avoid modifying the original dataframe

df_new=df.copy()

In [38]:
#filling missing values in 'gender ratio' with the mean value 

df_new['gender ratio'].fillna(mean_gender_ratio)

0       46 : 54
1       44 : 56
2       49 : 51
3       36 : 64
4       39 : 61
         ...
1521    42 : 58
1522    57 : 43
1523    54 : 46
1524    59 : 41
1525    34 : 66
Name: gender ratio, Length: 1526, dtype: object

In [39]:
#for removing the decimal part from the data use floor division

mean_gender_ratio//1

nan

In [44]:
#calculate the median for the 'students staff ratio'

median_students_staff_ratio=df['students staff ratio'].median()
median_students_staff_ratio

np.float64(16.1)

In [46]:
#calculate the mode of the students staff ratio

mode_student_staff_ratio=df['students staff ratio'].mode()[0]
mode_student_staff_ratio

np.float64(14.8)